000100220401             PGM
000200220401             RSTOBJ OBJ(*ALL) SAVLIB(CLARK) DEV(*SAVF) +
000300220401             SAVF(CLARK4/SAV1) RSTLIB(CLARK4)
000400220401             ENDPGM
